---
kind: method
id: M:Autodesk.Revit.DB.PointClouds.PointCloudOverrides.Dispose
source: html/2f1e7c6f-322b-c425-0226-b491e81b145a.htm
---
# Autodesk.Revit.DB.PointClouds.PointCloudOverrides.Dispose Method

Releases all resources used by the PointCloudOverrides

## Syntax (C#)
```csharp
public void Dispose()
```